In [26]:
import pyarrow as pa
import pyarrow.parquet as pq
from datetime import datetime

In [31]:
d = {
    "a": "aa",
    "b": 123,
    "c": 45.6,
    "d": datetime.strptime(d["d"], "%Y-%m-%d")
}

In [43]:
pat = pa.Table.from_pylist([d])
pat

pyarrow.Table
a: string
b: int64
c: double
d: timestamp[us]
----
a: [["aa"]]
b: [[123]]
c: [[45.6]]
d: [[2023-03-01 00:00:00.000000]]

In [33]:
pq.write_table(pat, 'example.parquet')

In [36]:
df = pq.read_table('example.parquet').to_pandas()
df

    a    b     c          d
0  aa  123  45.6 2023-03-01

In [37]:
df.dtypes

a            object
b             int64
c           float64
d    datetime64[ns]
dtype: object

In [49]:
df = pq.read_table('../data').to_pandas()
df.dtypes

title           object
isbn13         float64
author          object
date_pub        object
mean_rating    float64
num_rating       int64
user_rating      int64
date_read       object
date_added      object
dtype: object

In [50]:
df.head()

,title,isbn13,author,date_pub,mean_rating,num_rating,user_rating,date_read,date_added
0,Mabinogion Tales,9.780948e+12,"Guest, Charlotte",1410,3.95,20,5,"Mar 03, 2018","January 28, 2018"
1,The Lions of Al-Rassan,9.780061e+12,"Kay, Guy Gavriel",1995,4.30,21457,5,Apr 2017,"March 30, 2017"
2,Jane Eyre,9.780142e+12,"Brontë, Charlotte","Oct 16, 1847",4.14,1955530,5,None,"May 05, 2015"
3,The Sunne in Splendour,9.780345e+12,"Penman, Sharon Kay",Oct 1982,4.40,21289,5,"May 04, 2015","April 27, 2015"
4,"Shōgun (Asian Saga, #1)",NaN,"Clavell, James","Jun 01, 1975",4.40,167041,5,None,"April 03, 2015"